//
//  main.c
//  lab num 4
//
//  Created by Николай Ли on 16.02.2023.
//
// Написать функции, вычисляющие периметр и площадь треугольника по значениям длин трёх его сторон.
// Разместить их в отдельном модуле (отличном от того, где располагается функция main( )).
// Ввести с консоли значения длин сторон треугольника (с проверкой на корректность неравенства треугольника) и выдать на консоль вычисленные с помощью написанных функций значения его периметра и площади.

#include "Formula.h"

void formula(double a, double b, double c);

int main() {
    double a, b, c;
    scanf("%lf", &a);
    scanf("%lf", &b);
    scanf("%lf", &c);
    formula(a, b, c);
    
    return 0;
}
